In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
ser1=Series(np.arange(3),index=['A','B','C'])
ser2=ser1*2
ser1
ser2

A    0
B    2
C    4
dtype: int32

In [4]:
ser2['B']

2

In [8]:
ser2[0]

0

In [9]:
ser1[0:3]

A    0
B    1
C    2
dtype: int32

In [11]:
ser2[['A','B','C']]

A    0
B    2
C    4
dtype: int32

In [14]:
ser2[ser2>3]=10

In [15]:
ser2

A     0
B     2
C    10
dtype: int32

In [16]:
dframe=DataFrame(np.arange(25).reshape(5,5),index=['NYC','LA','SF','DC','CHI'],columns=['A','B','C','D','E'])

In [18]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [19]:
dframe['B']

NYC     1
LA      6
SF     11
DC     16
CHI    21
Name: B, dtype: int32

In [22]:
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [23]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [24]:
dframe >10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
CHI   True   True   True   True   True

In [26]:
dframe.ix[2]

A    10
B    11
C    12
D    13
E    14
Name: SF, dtype: int32

In [28]:
dframe=DataFrame(np.arange(4).reshape(2,2),index=['NYC','LA'],columns=list('AB'))

In [29]:
dframe

     A  B
NYC  0  1
LA   2  3

In [30]:
dframe1=DataFrame(np.arange(9).reshape(3,3),columns=list('ABC'),index=['NYC','LA','SF'])

In [31]:
dframe1

     A  B  C
NYC  0  1  2
LA   3  4  5
SF   6  7  8

In [32]:
dframe+dframe1

       A    B   C
LA   5.0  7.0 NaN
NYC  0.0  2.0 NaN
SF   NaN  NaN NaN

In [34]:
dframe.add(dframe1,fill_value=0)

       A    B    C
LA   5.0  7.0  5.0
NYC  0.0  2.0  2.0
SF   6.0  7.0  8.0

In [36]:
ser2=dframe.ix[0]

In [37]:
ser2

A    0
B    1
Name: NYC, dtype: int32

In [38]:
ser=Series(range(3),index=list('abc'))

In [39]:
ser

a    0
b    1
c    2
dtype: int32

In [40]:
ser.sort_index()

a    0
b    1
c    2
dtype: int32

In [42]:
ser.sort_order()

AttributeError: 'Series' object has no attribute 'sort_order'

In [43]:
ser2=Series(np.random.randn(10))

In [44]:
ser2

0   -0.031341
1   -0.170351
2   -0.171682
3   -0.725045
4    1.326853
5   -1.188855
6    0.861977
7    0.896483
8    1.195548
9   -1.946101
dtype: float64

In [46]:
ser2.rank()

0     6.0
1     5.0
2     4.0
3     3.0
4    10.0
5     2.0
6     7.0
7     8.0
8     9.0
9     1.0
dtype: float64